20250707111420-lesson_5_deliver_value.org
:PROPERTIES:
:ID:       de6e6675-83cc-4761-91fe-4fc12784a045
:END:
#+title: Lesson 5 Deliver Value
#+filetags: :SAFe

* 5.1 Continuously Integrate, deploy and release
** CALMR approach to DevOps
- (C)ulture of shared responsobility
- (A)utomation of CD pipelines
- (L)ean flow accelerates delivery
- (M)easurement of flow, quality and value
- (R)ecovery reduces risk and preserves value

** Continuous Delivery Pipeline

- Continuous Exploration (Understand Customer needs)
- Continuous Integration (Get fast feedback on small changes)
- Continuous Deployment (Get to production early for verification)

** Release on demand:
Decouple deployment from release
Feature flag

* 5.2 Syncs align delivery
Sync events drive the delivery of value.
Utlize syncs to maintain connectivity as you deliver and overcome challenges together.

ART sync is used to coordinate progress
- Coach sync (Weekly or more frequently 30 - 60 mins)
- PO Sync (Weekly or more frequently 30 - 60 mins)

* 5.3 Building quality in
Think shift-left
Shorted the define-build-test cycle
Remove barriers to collaboration
Design for quality
Deliver continuously for fast customer feedback

** Agile quality practices
Agile quality practices apply to every team, whether business or tech.
- Establish Flow (Avoid stopping and starting aas work moves through the system)
- Peer review and pairing (multiple viewpoints enhance knowledge and work quality)
- Collective ownership and standards (Reduce bottlenecks & ensure consistency)
- Automation (Minimize manual processes to enable smaller batches)
- Definition of Done (Ensure consisten quality measures for each work product)

** Agile Software development quality practices
- Continuous integration
- Test-first practices (Shift left)
- Refactoring
- Continuous delivery
- Agile Architecture

** Business quality practices
- Address specific functional quality standards
- Apply standards in an agile manner

** Agile hardware engineering quality practices
- Modeling and simulation
- Rapid prototyping

** Scalable Definition of Done
Team increment -> System Increment -> Solution Increment -> Release
