20250707111420-lesson_5_deliver_value.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-08 Sun 09:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Lesson 5 Deliver Value</title>
<meta name="author" content="Mikey" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Lesson 5 Deliver Value</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgdeacba0">1. 5.1 Continuously Integrate, deploy and release</a>
<ul>
<li><a href="#org98ef91c">1.1. CALMR approach to DevOps</a></li>
<li><a href="#orgc86915c">1.2. Continuous Delivery Pipeline</a></li>
<li><a href="#org37afd30">1.3. Release on demand:</a></li>
</ul>
</li>
<li><a href="#orgafde657">2. 5.2 Syncs align delivery</a></li>
<li><a href="#org5409b26">3. 5.3 Building quality in</a>
<ul>
<li><a href="#org3c16ab4">3.1. Agile quality practices</a></li>
<li><a href="#org9ec7437">3.2. Agile Software development quality practices</a></li>
<li><a href="#orgb277cec">3.3. Business quality practices</a></li>
<li><a href="#org50264ce">3.4. Agile hardware engineering quality practices</a></li>
<li><a href="#orgf4cec1c">3.5. Scalable Definition of Done</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgdeacba0" class="outline-2">
<h2 id="orgdeacba0"><span class="section-number-2">1.</span> 5.1 Continuously Integrate, deploy and release</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org98ef91c" class="outline-3">
<h3 id="org98ef91c"><span class="section-number-3">1.1.</span> CALMR approach to DevOps</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>(C)ulture of shared responsobility</li>
<li>(A)utomation of CD pipelines</li>
<li>(L)ean flow accelerates delivery</li>
<li>(M)easurement of flow, quality and value</li>
<li>(R)ecovery reduces risk and preserves value</li>
</ul>
</div>
</div>
<div id="outline-container-orgc86915c" class="outline-3">
<h3 id="orgc86915c"><span class="section-number-3">1.2.</span> Continuous Delivery Pipeline</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li>Continuous Exploration (Understand Customer needs)</li>
<li>Continuous Integration (Get fast feedback on small changes)</li>
<li>Continuous Deployment (Get to production early for verification)</li>
</ul>
</div>
</div>
<div id="outline-container-org37afd30" class="outline-3">
<h3 id="org37afd30"><span class="section-number-3">1.3.</span> Release on demand:</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Decouple deployment from release
Feature flag
</p>
</div>
</div>
</div>
<div id="outline-container-orgafde657" class="outline-2">
<h2 id="orgafde657"><span class="section-number-2">2.</span> 5.2 Syncs align delivery</h2>
<div class="outline-text-2" id="text-2">
<p>
Sync events drive the delivery of value.
Utlize syncs to maintain connectivity as you deliver and overcome challenges together.
</p>

<p>
ART sync is used to coordinate progress
</p>
<ul class="org-ul">
<li>Coach sync (Weekly or more frequently 30 - 60 mins)</li>
<li>PO Sync (Weekly or more frequently 30 - 60 mins)</li>
</ul>
</div>
</div>
<div id="outline-container-org5409b26" class="outline-2">
<h2 id="org5409b26"><span class="section-number-2">3.</span> 5.3 Building quality in</h2>
<div class="outline-text-2" id="text-3">
<p>
Think shift-left
Shorted the define-build-test cycle
Remove barriers to collaboration
Design for quality
Deliver continuously for fast customer feedback
</p>
</div>
<div id="outline-container-org3c16ab4" class="outline-3">
<h3 id="org3c16ab4"><span class="section-number-3">3.1.</span> Agile quality practices</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Agile quality practices apply to every team, whether business or tech.
</p>
<ul class="org-ul">
<li>Establish Flow (Avoid stopping and starting aas work moves through the system)</li>
<li>Peer review and pairing (multiple viewpoints enhance knowledge and work quality)</li>
<li>Collective ownership and standards (Reduce bottlenecks &amp; ensure consistency)</li>
<li>Automation (Minimize manual processes to enable smaller batches)</li>
<li>Definition of Done (Ensure consisten quality measures for each work product)</li>
</ul>
</div>
</div>
<div id="outline-container-org9ec7437" class="outline-3">
<h3 id="org9ec7437"><span class="section-number-3">3.2.</span> Agile Software development quality practices</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Continuous integration</li>
<li>Test-first practices (Shift left)</li>
<li>Refactoring</li>
<li>Continuous delivery</li>
<li>Agile Architecture</li>
</ul>
</div>
</div>
<div id="outline-container-orgb277cec" class="outline-3">
<h3 id="orgb277cec"><span class="section-number-3">3.3.</span> Business quality practices</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Address specific functional quality standards</li>
<li>Apply standards in an agile manner</li>
</ul>
</div>
</div>
<div id="outline-container-org50264ce" class="outline-3">
<h3 id="org50264ce"><span class="section-number-3">3.4.</span> Agile hardware engineering quality practices</h3>
<div class="outline-text-3" id="text-3-4">
<ul class="org-ul">
<li>Modeling and simulation</li>
<li>Rapid prototyping</li>
</ul>
</div>
</div>
<div id="outline-container-orgf4cec1c" class="outline-3">
<h3 id="orgf4cec1c"><span class="section-number-3">3.5.</span> Scalable Definition of Done</h3>
<div class="outline-text-3" id="text-3-5">
<p>
Team increment -&gt; System Increment -&gt; Solution Increment -&gt; Release
</p>
</div>
</div>
</div>
</div>
</body>
</html>
